django_cscwrapper/templates/SubmitOfflineSearch.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soap:Body>
      <SubmitOfflineSearch xmlns="https://eservices.cscfinancialonline.com/">
         <params>
            <param name="contactNo">{{ contact_no }}</param>
            <param name="loginGuid">{{ guid }}</param>
            <param name="type">{{ search_type }}</param>
            <param name="stateCD">{{ state }}</param>

            {% if delivery_method %}<param name="jurisdictionName">{{ jurisdiction_name }}</param>{% endif %}
            {% if jurisdiction_id %}<param name="jurisdictionID">{{ jurisdiction_id }}</param>{% endif %}
            {% if lapsed_term %}<param name="lapsedTerm">{{ lapsed_term }}</param>{% endif %}
            {% if lapsed_term_Year %}<param name="lapsedTermYear">{{ lapsed_term_Year }}</param>{% endif %}
            {% if start_date %}<param name="startDate">{{ start_date }}</param>{% endif %}
            {% if secondary_delivery_method %}<param name="secondaryDeliveryMethod">{{ secondary_delivery_method }}</param>{% endif %}
            {% if use_third_party %}<param name="useThirdParty">{{ use_third_party }}</param>{% endif %}
            {% if doc_number %}<param name="docNumber">{{ doc_number }}</param>{% endif %}

            {% if first_name %}<param name="firstName">{{ first_name }}</param>{% endif %}
            {% if last_name %}<param name="lastName">{{ last_name }}</param>{% endif %}
            {% if company_name %}<param name="companyName">{{ company_name }}</param>{% endif %}
            {% if secured_party_name %}<param name="securedPartyName">{{ secured_party_name }}</param>{% endif %}
            {% if business_id %}<param name="businessID">{{ business_id }}</param>{% endif %}
            {% if debtor_name %}<param name="debtorName">{{ debtor_name }}</param>{% endif %}
            {% if ficticious_business_name %}<param name="ficticiousBusinessName">{{ ficticious_business_name }}</param>{% endif %}
            {% if owner_name %}<param name="ownerName">{{ owner_name }}</param>{% endif %}

            {% if document %}<param name="document">{{ document }}</param>{% endif %}
            {% if certified %}<param name="certified">{{ certified }}</param>{% endif %}
            {% if subject %}<param name="subject">{{ subject }}</param>{% endif %}
            {% if criteria %}<param name="criteria">{{ criteria }}</param>{% endif %}
            {% if open_type %}<param name="openType">{{ open_type }}</param>{% endif %}
            {% if litigant_type %}<param name="litigantType">{{ litigant_type }}</param>{% endif %}
            {% if complaint %}<param name="complaint">{{ complaint }}</param>{% endif %}
            {% if last_action_filed %}<param name="lastActionFiled">{{ last_action_filed }}</param>{% endif %}

            {% if dat_of_birth %}<param name="dateOfBirth">{{ dat_of_birth }}</param>{% endif %}
            {% if ssn %}<param name="SSN">{{ ssn }}</param>{% endif %}
            {% if address %}<param name="address">{{ address }}</param>{% endif %}
            {% if city %}<param name="city">{{ city }}</param>{% endif %}
            {% if state %}<param name="state">{{ state }}</param>{% endif %}
            {% if country %}<param name="country">{{ country }}</param>{% endif %}
            {% if county %}<param name="county">{{ county }}</param>{% endif %}
            {% if borrower %}<param name="borrower">{{ borrower }}</param>{% endif %}

            {% if second_borrower %}<param name="secondBorrower">{{ second_borrower }}</param>{% endif %}
            {% if loan_number %}<param name="loanNumber">{{ loan_number }}</param>{% endif %}
            {% if tax_number %}<param name="taxNumber">{{ tax_number }}</param>{% endif %}
            {% if legal_desc %}<param name="legalDesc">{{ legal_desc }}</param>{% endif %}

            {% if delivery_method %}<param name="deliveryMethodType">{{ delivery_method }}</param>{% endif %}
            {% if delivery_method_value %}<param name="deliveryMethodValue">{{ delivery_method_value }}</param>{% endif %}
            {% if rush %}<param name="rush">{{ rush }}</param>{% endif %}
            {% if special_instructions %}<param name="specialInstructions">{{ special_instructions }}</param>{% endif %}

            {% if references %}
                <param name="references">
                    <array>
                    {% for reference in references %}
                        <item>
                            <key>{{ reference.key }}</key>
                            <value>{{ reference.value }}</value>
                        </item>
                    {% endfor %}
                    </array>
                </param>
            {% endif %}
        </params>
    </SubmitOfflineSearch>
</soap:Body>
</soap:Envelope>